{
    "name" : "All-Butter Pie Dough",
    "meat" : "V",
    "website" : "",
    "steps" : [
        {
            "step_number" : 1,
            "step_description" : "Place the flour, sugar, and salt in bowl of a stand mixer with a paddle attachment, then freeze the whole thing for 20 minutes (if you can't fit the bowl in your freezer, then just freeze the ingredients). Freeze the butter and ice water as well."
        },
        {
            "step_number" : 2,
            "step_description" : "Fit the bowl on the mixer and turn to the lowest speed. Add the cubed butter, a few pieces at a time, and mix until the butter looks like broken walnut pieces. Distinct bits of butter lead to beautiful flakes in the dough so avoid overmixing."
        },
        {
            "step_number" : 3,
            "step_description" : "Add the vinegar in a thin stream. Add just enough water and mix as little as possible until the dough barely holds together - you'll probably need close to the entire 1/2 cup. Some shaggy bits are fine. If you're not sure whether or not the dough needs more water, stop the mixer and take a handful of dough in your palm. Squeeze it hard, then gently try to break it apart. If it crumbles apart very easily and feels very dry, add more water. If it holds together or breaks into a few chunks, you're done."
        },
        {
            "step_number" : 4,
            "step_description" : "On the counter, pull out a long piece of plastic wrap from the roll but do not cut it. In a quick, fearless motion, flip the bowl over onto the plastic wrap. Remove the bowl and avoid touching the dough. Cut the plastic from the roll and, lifting both ends, use it ot encourage all the dough into a ball. Don't worry if there are few dry bits - the flour will evenly absorb the moisture with time. Twist the plastic tightly around the dough to form a ball. Use a sharp knife to cut the ball in half through the plastic, wrap each half again tightly with plastic, and press each half into a disk. Chill for at least 2 hours or overnight."
        },
        {
            "step_number" : 5,
            "step_description" : "To freeze unwrapped, prepared dough for up to 2 months, double-wrap it in plastic and then wrap it in aluminum foil to prevent freezer burn. Allow the dough to defrost in the refrigerator overnight before using."
        }
    ],
    "ingredients" : [
        {
            "name": "White Vinegar",
            "amount": 1,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Ice Water",
            "amount": 0.5,
            "unit": "Cup",
            "preparation": ""
        },
        {
            "name": "Unsalted Butter",
            "amount": 2,
            "unit": "Sticks",
            "preparation": "Chilled and cut into 1/2 inch cubes"
        },
        {
            "name": "Salt",
            "amount": 1,
            "unit": "Large Pinch",
            "preparation": ""
        },
        {
            "name": "Sugar",
            "amount": 1,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "All Purpose Flour",
            "amount": 2.25,
            "unit": "Cup",
            "preparation": ""
        }
    ]
}
