{
    "name" : "Minimalist Baker Vibrant Collard Green Wraps with Green Curry Tahini Sauce",
    "meat" : "VEGAN",
    "website" : "https://minimalistbaker.com/vibrant-collard-green-wrap-with-green-curry-tahini-sauce/",
    "steps" : [
        {
            "step_number" : 1,
            "step_description" : "Start by rinsing collard green, patting dry, and chopping off the bulky end of the stem (where the base of the leaves meet). Then use a sharp knife to carefully shave down the thickness of the remaining stem so it folds and wraps easily (see photo)."
        },
        {
            "step_number" : 2,
            "step_description" : "Prep all veggies by thinly slicing with a knife, mandolin, or food processor. Set aside."
        },
        {
            "step_number" : 3,
            "step_description" : "Prepare your sauce by adding green curry paste, tahini, lemon or lime juice, and maple syrup to a small bowl and whisking to combine. Depending on the brand of your curry paste and tahini, you may need to add a little water to thin so it’s a dippable sauce. Taste and adjust flavor as needed, adding more citrus for acidity, maple syrup for sweetness, or tahini for creaminess. Set aside for serving."
        },
        {
            "step_number" : 4,
            "step_description" : "To assemble, add your hummus to bottom third of the collard green, then gradually build on top in layers, adding your shredded beet, carrot, bell pepper, avocado, sprouts, and sauerkraut (or kimchi or cabbage)."
        },
        {
            "step_number" : 5,
            "step_description" : "Next, press it all down so it’s in the bottom 1/3 of the collard green, fold the base over the ingredients, tuck in the sides to secure the fillings, and continue rolling away from you until the seams meet. Cut in half or eat whole. Repeat the process to make desired number of wraps. Enjoy immediately with green curry tahini sauce on the side for dipping / spooning on top."
        },
        {
            "step_number" : 6,
            "step_description" : "Store leftovers covered in the refrigerator for up to 2-3 days. The sauce will keep when stored separately for up to 5 days. Not freezer friendly."
        }
    ],
    "ingredients" : [
        {
            "name": "Collard Leaf",
            "amount": 1,
            "unit": "",
            "preparation": ""
        },
        {
            "name": "Hummus",
            "amount": 2,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Beet",
            "amount": 0.25,
            "unit": "Cup",
            "preparation": "Shredded"
        },
        {
            "name": "Carrot",
            "amount": 0.25,
            "unit": "Cup",
            "preparation": "Shredded"
        },
        {
            "name": "Red Bell Pepper",
            "amount": 0.25,
            "unit": "Cup",
            "preparation": "Thinly Sliced"
        },
        {
            "name": "Avocado",
            "amount": 3,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Sprouts",
            "amount": 0.25,
            "unit": "Cup",
            "preparation": ""
        },
        {
            "name": "Kimchi",
            "amount": 1,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Green Curry Paste",
            "amount": 3,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Tahini",
            "amount": 1,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Lemon Juice",
            "amount": 1,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Maple Syrup",
            "amount": 1,
            "unit": "tsp",
            "preparation": ""
        }
    ]
}
