{
    "name" : "Sweet Potato & Black Bean Veggie Burgers",
    "meat" : "V",
    "website" : "http://cookieandkate.com/2013/sweet-potato-black-bean-veggie-burgers/",
    "steps" : [
        {
            "step_number" : 1,
            "step_description" : "Roast the sweet potatoes: Preheat the oven to 400 degrees Fahrenheit. Slice the sweet potatoes down the center lengthwise. Place the sweet potatoes cut side down on a rimmed baking sheet. Roast until they yield to a gentle squeeze, 30 to 40 minutes or longer. Once the sweet potatoes are cool enough to handle, remove the skin (it should pull off easily) and roughly chop the insides. Set aside to cool completely."
        },
        {
            "step_number" : 2,
            "step_description" : "Cook the millet: In a small saucepan, bring 1 cup of water to boil. Stir in the millet, reduce heat to low and simmer, covered, until tender (about 25 minutes). Drain off any remaining liquid and set aside to cool. OR cook the quinoa: Rinse the quinoa in a fine mesh colander, then combine with ⅔ cup water in a small saucepan. Bring the mixture to boil, then cover and reduce heat to maintain a gentle simmer. Simmer for 15 minutes, then remove from heat and let the quinoa steam with the lid on for 5 minutes. Then drain off any excess water and set aside to cool."
        },
        {
            "step_number" : 3,
            "step_description" : "Grind the oats: Use a food processor or blender to grind the oats until the flakes are broken up, but not as fine as flour."
        },
        {
            "step_number" : 4,
            "step_description" : "Mix the burgers: In a large mixing bowl or the bowl of your electric mixer, combine the cooled sweet potatoes and millet, black beans, onion, cilantro, cumin, chili powder, chipotle or paprika, cayenne (optional, add to taste for spicier burgers) and salt. Use a potato masher, big mixing spoon or the paddle attachment of your mixer to mix really well. It's ok if the black beans get smashed in the process."
        },
        {
            "step_number" : 5,
            "step_description" : "Mix in the oats: Sprinkle the ground oats over the mixture and mix well with a big spoon until the mixture holds together when you shape a portion into a patty. If possible, cover and refrigerate the mixture for best results (the patties will hold together better during cooking if they are chilled first)."
        },
        {
            "step_number" : 6,
            "step_description" : "Shape the burgers: Use a measuring cup to measure out ½ cup of the mixture. Gently shape it into a patty about 3½ inches in diameter. Use your hands to gently flatten the burgers and smooth out any jagged edges. Repeat the process for each patty; you should end up with 8. If you would like to toast your hamburger buns, preheat the oven to 350 degrees now."
        },
        {
            "step_number" : 7,
            "step_description" : "Pan fry the burgers: Heat 1 tablespoon oil in a large cast iron or non-stick skillet over medium heat. When it's hot, place several burgers in the pan, leaving enough room to flip them. Cook each patty until browned and heated through, about 3 to 4 minutes per side. Add 1 tablespoon oil to the skillet for each pan of burgers you fry."
        },
        {
            "step_number" : 8,
            "step_description" : "Toast the buns (optional): Place the buns on a baking sheet, cut sides up, and bake until lightly toasted, about 2 to 3 minutes."
        }
    ],
    "ingredients" : [
        {
            "name": "Sweet Potatoes",
            "amount": 1.5,
            "unit": "lb",
            "preparation": "Smaller"
        },
        {
            "name": "Quinoa",
            "amount": 0.33,
            "unit": "Cup",
            "preparation": ""
        },
        {
            "name": "Old Fashioned Oats",
            "amount": 1,
            "unit": "Cup",
            "preparation": ""
        },
        {
            "name": "Black Beans",
            "amount": 1,
            "unit": "Can",
            "preparation": ""
        },
        {
            "name": "Red Onion",
            "amount": 0.5,
            "unit": "",
            "preparation": "Diced"
        },
        {
            "name": "Cilantro",
            "amount": 0.5,
            "unit": "Cup",
            "preparation": "Chopped"
        },
        {
            "name": "Cumin Powder",
            "amount": 2,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Chili Powder",
            "amount": 2,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Paprika",
            "amount": 1,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Cayenne Powder",
            "amount": 0.5,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Salt",
            "amount": 0.5,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Vegetable Oil",
            "amount": 1,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Wheat Buns",
            "amount": 8,
            "unit": "",
            "preparation": ""
        },
        {
            "name": "Fixings",
            "amount": 1,
            "unit": "",
            "preparation": ""
        }
    ]
}
