{
    "name" : "Fall Veggie and Quinoa Hash Poached Eggs",
    "meat" : "V",
    "website" : "http://www.wholeliving.com/132622/fall-vegetable-and-quinoa-hash-poached-eggs",
    "steps" : [
        {
            "step_number" : 1,
            "step_description" : "Preheat oven to 400 degrees. Toss sweet potato with 1/2 teaspoon oil and 1/4 teaspoon salt; spread in an even layer on half of a rimmed baking sheet. Toss beets with 1/2 teaspoon oil and 1/8 teaspoon salt; spread on other half of sheet (so that beets don't discolor potatoes). Roast, stirring halfway through, until tender, 35 to 40 minutes."
        },
        {
            "step_number" : 2,
            "step_description" : "Meanwhile, bring a large saucepan of water to a boil; add vinegar. Break each egg into a teacup. Reduce heat so that water is just simmering. Slightly immerse 1 teacup, and gently slide egg into water. Use a spoon to fold edges of white over egg. Repeat with remaining eggs. Simmer until whites are just set but yolks are runny, 2 to 3 minutes. Transfer eggs to a towel using a slotted spoon, and drain."
        },
        {
            "step_number" : 3,
            "step_description" : "Thinly slice beet greens. Heat 1 1/2 teaspoons oil in a large nonstick skillet over medium heat. Add greens, leek, 1/4 teaspoon salt, and 1/4 teaspoon pepper; cook until tender and lightly browned, 8 to 10 minutes. Stir in quinoa, thyme, and vegetables; press down using a rubber spatula. Cook until quinoa is warm, 1 to 2 minutes. Divide among 4 plates; top each with 1 egg, and season with a pinch of pepper."
        }
    ],
    "ingredients" : [
        {
            "name": "Sweet Potato",
            "amount": 1,
            "unit": "Large",
            "preparation": "Cut into 1/2 inch cubes"
        },
        {
            "name": "Extra Virgin Olive Oil",
            "amount": 2.5,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Beets",
            "amount": 2,
            "unit": "",
            "preparation": "Peeled and cut into 1/2-inch wedges, greens reserved and rinsed well"
        },
        {
            "name": "White-Wine Vinegar",
            "amount": 1,
            "unit": "Tbs",
            "preparation": ""
        },
        {
            "name": "Eggs",
            "amount": 4,
            "unit": "Large",
            "preparation": ""
        },
        {
            "name": "Leek",
            "amount": 1,
            "unit": "",
            "preparation": "White and pale-green parts only, halved lengthwise, cut 1/4 inch thick, and rinsed well"
        },
        {
            "name": "Dry Quinoa",
            "amount": 0.25,
            "unit": "Cup",
            "preparation": "Cooked"
        },
        {
            "name": "Thyme",
            "amount": 0.75,
            "unit": "",
            "preparation": "Chopped"
        }
    ]
}