{
    "name" : "Sage and Garlic Roasted Chicken, Pomegranate Glaze",
    "meat" : "C",
    "website" : "http://www.insockmonkeyslippers.com/sage-and-garlic-roasted-chicken-with-pomegranate-and-black-pepper-glaze",
    "steps" : [
        {
            "step_number" : 1,
            "step_description" : "Preheat oven to 425°F. Finely chop the sage and garlic."
        },
        {
            "step_number" : 2,
            "step_description" : "Combine the butter, sage, garlic, and salt in a bowl and mix well until combined."
        },
        {
            "step_number" : 3,
            "step_description" : "With your hands (think of it as an expensive hand cream), rub the butter over the entire chicken including the cavity and underneath the skin. Place any additional sage or garlic inside the cavity (optional)."
        },
        {
            "step_number" : 4,
            "step_description" : "I like to truss (tie up) my chickens. Think of it as 50 Shades of Chicken. Trussing a chicken keeps everything bound and helps with even cooking. I am just a tad dyslexic so I truss a chicken backwards but I think it’s simple and it gets the job done. Here’s how you do it: Cut a 3 ft (arm span) of cooking twine. With the chicken breast side up and the cavity facing you, slide the twine underneath the wings at the top end of the chicken. Next, hold up both ends of the twine and bring them toward you and over the tops of the drumsticks."
        },
        {
            "step_number" : 5,
            "step_description" : "Then bring the twine down and underneath the drumstick ends."
        },
        {
            "step_number" : 6,
            "step_description" : "Next, hold the twine up and tie a bow pulling both legs together. This is optional. You can also just tie the drumstick ends together with cooking twine and tuck the wing tips in towards the chicken. It’s not like the chicken isn’t going to get cooked if it’s not trussed but it will keep the outer parts of the drumsticks from getting dry and makes the chicken juicier in my opinion."
        },
        {
            "step_number" : 7,
            "step_description" : "Place the chicken in the middle of a roasting pan or cast iron skillet and add any vegetables mentioned above around the chicken. Drizzle the vegetables lightly with olive oil and a sprinkle of salt and pepper. Place the chicken in the oven and roast for 1 hour and 15 minutes."
        },
        {
            "step_number" : 8,
            "step_description" : "While the chicken is roasting, pour the pomegranate juice in a sauce pot and add pepper. Stir and bring to a boil. Reduce heat to medium and simmer until the juice has reduced by 3/4 and formed a syrup, about 15 minutes."
        },
        {
            "step_number" : 9,
            "step_description" : "The glaze will be finished when it thickly coats the back of a spoon."
        },
        {
            "step_number" : 10,
            "step_description" : "Remove the chicken from the oven and pour half of the glaze over the chicken. If the glaze has hardened, heat it over low heat until fluid. Evenly spread the glaze over the chicken with a kitchen/pastry brush. Reserve leftover glaze for serving/plating. Return the chicken to the oven and roast for an additional 10 minutes."
        },
        {
            "step_number" : 11,
            "step_description" : "Allow the chicken to rest for 5 to 10 minutes before carving."
        },
        {
            "step_number" : 12,
            "step_description" : "Carve and plate. Spoon pomegranate black pepper glaze over and garnish with pomegranate seeds, if desired."
        }
    ],
    "ingredients" : [
        {
            "name": "Chicken",
            "amount": 1,
            "unit": "4lb Fryer Chicken",
            "preparation": ""
        },
        {
            "name": "Fresh Sage",
            "amount": 2,
            "unit": "Tbs",
            "preparation": "Chopped"
        },
        {
            "name": "Garlic",
            "amount": 2,
            "unit": "Cloves",
            "preparation": "Chopped"
        },
        {
            "name": "Unsalted Butter",
            "amount": 4,
            "unit": "Tbs",
            "preparation": "Softened"
        },
        {
            "name": "Salt",
            "amount": 1,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Pomegranate Juice",
            "amount": 2,
            "unit": "Cup",
            "preparation": ""
        },
        {
            "name": "Black Pepper",
            "amount": 1,
            "unit": "tsp",
            "preparation": ""
        },
        {
            "name": "Pomegranate Seeds",
            "amount": 1,
            "unit": "Garnish",
            "preparation": ""
        },
        {
            "name": "Sage Leaves",
            "amount": 1,
            "unit": "Garnish",
            "preparation": ""
        },
        {
            "name": "Some Winter Squash",
            "amount": 1,
            "unit": "",
            "preparation": ""
        },
        {
            "name": "Apples",
            "amount": 2,
            "unit": "",
            "preparation": ""
        },
        {
            "name": "Sweet Potatoes",
            "amount": 2,
            "unit": "",
            "preparation": ""
        }
    ]
}